app/views/projects/show.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
      <label for="project_users" class="form-label">Project Creator:</label>
      <% creator = User.find(@project.created_by) %>