app/views/bugs/show.html.erb

    <label for="project_users" class="form-label">Bug Creator:</label>
    <% creator = User.find(@bug.created_by) %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]