app/controllers/bugs_controller.rb

  def create

    @bug = @project.bugs.new(bug_params)
    @bug.created_by = current_user.id
---
INSERT INTO "bugs" ("title", "description", "user_id", "project_id", "created_by", "created_at", "updated_at", "deadline", "screenshot", "bug_type", "status") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"

  def update
    authorize @bug
    if @bug.update(bug_params)
---
UPDATE "bugs" SET "title" = ?, "updated_at" = ? WHERE "bugs"."id" = ?  [["title", "Updated Bug Title"], ["updated_at", "2024-04-18 11:00:38.152046"], ["id", 1]]

  def destroy
    authorize @bug
    @bug.destroy
---
DELETE FROM "bugs" WHERE "bugs"."id" = ?  [["id", 1]]

  def set_bug
    @bug = @project.bugs.find(params[:id])
---
SELECT "bugs".* FROM "bugs" WHERE "bugs"."project_id" = ? AND "bugs"."id" = ? LIMIT ?  [["project_id", 1], ["id", 1], ["LIMIT", 1]]