app/controllers/projects_controller.rb

INSERT INTO "project_users" ("user_id", "project_id", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["user_id", 1], ["project_id", 1], ["created_at", "2024-04-25 09:46:40.931248"], ["updated_at", "2024-04-25 09:46:40.931248"]]
INSERT INTO "projects" ("name", "description", "created_at", "updated_at", "created_by") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["name", "Sample Project"], ["description", "Sample project description"], ["created_at", "2024-04-24 19:00:53.517072"], ["updated_at", "2024-04-24 19:00:53.517072"], ["created_by", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def create
    @project = Project.new(project_params)
    @project.users << current_user
    @project.created_by = current_user.id
    # @project.bugs.created_by = current_user.id

    authorize @project

    if @project.save
      if params[:user_ids].present?
        user_ids = params[:user_ids].reject(&:empty?)
        user_ids.each do |user_id|
          @project.users << User.find(user_id)

SELECT "bugs"."user_id" FROM "bugs" WHERE "bugs"."project_id" = ?  [["project_id", 1]]
SELECT "users"."id" FROM "users" INNER JOIN "projects_users" ON "users"."id" = "projects_users"."user_id" WHERE "projects_users"."project_id" = ?  [["project_id", 1]]
UPDATE "projects" SET "name" = ?, "description" = ?, "updated_at" = ?, "created_by" = ? WHERE "projects"."id" = ?  [["name", "Updated Project Name"], ["description", "Updated project description"], ["updated_at", "2024-04-25 12:30:37.600610"], ["created_by", 2], ["id", 1]]
---
  def update
    authorize @project

    # Store the current users before updating the project
    current_user_ids = @project.user_ids

    # Store the current assigned bug users before updating the project
    current_bug_user_ids = @project.bugs.pluck(:user_id)

    if @project.update(project_params)

DELETE FROM "projects" WHERE "projects"."id" = ?  [["id", 1]]
---
  def destroy
    authorize @project
    @project.destroy