app/controllers/projects_controller.rb

  def update
    authorize @project

    # Store the current user IDs before updating the project
    current_user_ids = @project.project_users.pluck(:user_id)
---
SELECT "project_users"."user_id" FROM "project_users" WHERE "project_users"."project_id" = ?  [["project_id", 1]]